import React from 'react';

const AgreeThree: React.FC = () => {
  return (
    <p>
      제 1 조 (목적) 본 약관은 올래(이하 "회사")가 제공하는 위치기반 서비스(이하
      "서비스")를 이용함에 있어 "회사"와 회원의 권리·의무 및 책임사항을 규정함을
      목적으로 한다. 제 2 조 (이용약관의 효력 및 변경) ① 본 약관은 서비스를
      신청한 고객 또는 개인위치정보주체가 본 약관에 동의하고 "회사"가 정한
      소정의 절차에 따라 서비스의 이용자로 등록함으로써 효력이 발생한다. ②
      회원이 온라인에서 본 약관의 "동의하기" 버튼을 클릭하였을 경우 본 약관의
      내용을 모두 읽고 이를 충분히 이해하였으며, 그 적용에 동의한 것으로 본다. ③
      "회사"는 위치정보의 보호 및 이용 등에 관한 법률, 콘텐츠산업 진흥법,
      전자상거래 등에서의 소비자보호에 관한 법률, 소비자기본법, 약관의 규제에
      관한 법률 등 관련법령을 위배하지 않는 범위에서 본 약관을 개정할 수 있다. ④
      "회사"가 약관을 개정할 경우에는 적용일자 및 개정사유를 명시하여 현행약관과
      함께 그 개정약관의 적용일자 7일 전부터 적용일자 전일까지 공지한다. 단
      회원의 권리, 의무에 중대한 영향을 주는 변경의 경우에는 적용일자 30일
      전부터 공지하도록 한다. ⑤ 회원은 변경된 약관에 대해 거부할 권리가 있다.
      회원은 변경된 약관이 공지된 지 15일 이내에 거부의사를 표명할 수 있다.
      회원이 거부하는 경우 본 서비스 제공자인 "회사"는 15일의 기간을 정하여
      회원에게 사전 통지 후 당해 회원과의 계약을 해지할 수 있다. 만약, 회원이
      거부의사를 표시하지 않거나, 전항에 따라 시행일 이후에 "서비스"를 이용하는
      경우에는 동의한 것으로 간주한다. 제 3 조 (관계법령의 적용) 본 약관은
      신의성실의 원칙에 따라 공정하게 적용하며, 본 약관에 명시되지 아니한 사항에
      대하여는 관계법령 또는 상관례에 따른다. 제 4 조 (서비스의 내용) "회사"가
      제공하는 서비스는 아래와 같다. 서비스명 서비스 내용 위치기반 서비스 - 현
      위치를 이용한 국내지역 채용정보 검색 - 현 위치를 활용하여 채용정보
      검색결과 제시 - 현 위치 내지 특정 위치를 지도 내에 표기하여 채용정보 제공
      - 현 위치 내지 특정 위치를 저장 - 저장한 위치를 기반으로 채용정보 검색결과
      제시 - 현 위치를 이용한 게시물 검색결과 제시 제 5 조 (서비스 이용요금) ①
      "회사"가 제공하는 서비스는 기본적으로 무료이며, 별도의 유료 서비스의 경우
      해당 서비스에 명시된 요금을 지불하여야 사용 가능하다. ② "회사"는 유료
      서비스 이용요금을 "회사"와 계약한 전자지불업체에서 정한 방법에 의하거나
      "회사"가 정한 청구서에 합산하여 청구할 수 있다. ③ 유료서비스 이용을 통하여
      결제된 대금에 대한 취소 및 환불은 "회사"의 결제 이용약관 등 관계법에
      따른다. ④ 회원의 개인정보도용 및 결제사기로 인한 환불요청 또는 결제자의
      개인정보 요구는 법률이 정한 경우 외에는 거절될 수 있다. ⑤ 무선 서비스 이용
      시 발생하는 데이터 통신료는 별도이며 가입한 각 이동통신사의 정책에 따른다.
      ⑥ MMS 등으로 게시물을 등록할 경우 발생하는 요금은 이동통신사의 정책에
      따른다. 제 6 조 (서비스내용변경 통지 등) ① "회사"가 서비스 내용을
      변경하거나 종료하는 경우 "회사"는 회원의 등록된 전자우편 주소로 이메일을
      통하여 서비스 내용의 변경 사항 또는 종료를 통지하여야 한다. ② ①항의 경우
      불특정 다수인을 대상으로 통지를 함에 있어서는 웹사이트 등 기타 "회사"의
      공지사항을 통하여 회원들에게 통지할 수 있다. 제 7 조 (서비스이용의 제한 및
      중지) ① "회사"는 아래 각 호의 1에 해당하는 사유가 발생한 경우에는 회원의
      서비스 이용을 제한하거나 중지시킬 수 있다. 1. 회원이 "회사" 서비스의
      운영을 고의 또는 중과실로 방해하는 경우 2. 서비스용 설비 점검, 보수 또는
      공사로 인하여 부득이한 경우 3. 전기통신사업법에 규정된 기간통신사업자가
      전기통신 서비스를 중지했을 경우 4. 국가비상사태, 서비스 설비의 장애 또는
      서비스 이용의 폭주 등으로 서비스 이용에 지장이 있는 때 5. 기타 중대한
      사유로 인하여 "회사"가 서비스 제공을 지속하는 것이 부적당하다고 인정하는
      경우 ② "회사"는 전항의 규정에 의하여 서비스의 이용을 제한하거나 중지한
      때에는 그 사유 및 제한기간 등을 회원에게 알려야 한다. 제 8 조
      (개인위치정보의 이용 또는 제공) ① “회사”는 서비스 제공을 위하여 회원의
      위치정보를 이용할 수 있으며, 회원은 본 약관에 동의함으로써 이에 동의한
      것으로 본다. ② "회사"는 타사업자 또는 이용 고객과의 요금정산 및 민원처리를
      위해 위치정보 이용·제공사실 확인자료를 자동 기록·보존하며, 해당 자료는
      1년간 보관한다. ③ "회사"는 개인위치정보를 회원이 지정하는 제3자에게
      제공하는 경우에는 개인위치정보를 수집한 당해 통신 단말장치로 매회 회원에게
      제공받는 자, 제공일시 및 제공목적을 즉시 통보한다. 단, 아래 각 호의 1에
      해당하는 경우에는 회원이 미리 특정하여 지정한 통신 단말장치 또는
      전자우편주소로 통보한다. 1. 개인위치정보를 수집한 당해 통신단말장치가
      문자, 음성 또는 영상의 수신기능을 갖추지 아니한 경우 2. 회원이 온라인 게시
      등의 방법으로 통보할 것을 미리 요청한 경우 ④ "회사"는 회원의 개인위치정보
      또는 위치정보 이용·제공사실 확인자료를 이용약관에 명시 또는 고지한 범위를
      넘어 이용하거나 제3자에게 제공하고자 하는 경우에는 회원의 동의를 받아야
      한다. 단, 아래의 경우는 제외한다. 1. 위치정보 및 위치기반서비스 제공에
      따른 요금정산을 위하여 위치정보 이용·제공사실 확인자료가 필요한 경우 2.
      통계작성, 학술연구 또는 시장조사를 위하여 특정 개인을 알아볼 수 없는
      형태로 가공하여 제공하는 경우 제 9 조 (개인위치정보주체의 권리) ① 회원은
      "회사"에 대하여 언제든지 개인위치정보를 이용한 위치기반서비스 제공 및
      개인위치정보의 제3자 제공에 대한 동의의 전부 또는 일부를 철회할 수 있다.
      이 경우 "회사"는 위치정보 이용·제공사실 확인자료를 파기하여야 한다. ②
      회원은 "회사"에 대하여 언제든지 개인위치정보의 이용 또는 제공의 일시적인
      중지를 요구할 수 있으며, "회사"는 이를 거절할 수 없고 이를 위한 기술적
      수단을 갖추고 있어야 한다. ③ 회원은 "회사"에 대하여 아래 각 호의 자료에
      대한 열람 또는 고지를 요구할 수 있고, 당해 자료에 오류가 있는 경우에는 그
      정정을 요구할 수 있다. 이 경우 "회사"는 정당한 사유 없이 회원의 요구를
      거절할 수 없다. 1. 본인에 대한 위치정보 이용·제공사실 확인자료 2. 본인의
      개인위치정보가 위치정보의 보호 및 이용 등에 관한 법률 또는 다른 법률
      규정에 의하여 제3자에게 제공된 이유 및 내용 ④ 회원은 제1호 내지 제3호의
      권리행사를 위해 "회사"의 소정의 절차를 통해 요구할 수 있다. 제 10 조
      (법정대리인의 권리) ① "회사"가 14세 미만의 회원으로부터 제 8조의 규정에
      의하여 개인위치정보를 이용 또는 제공하고자 하는 경우에는 그 법정대리인의
      동의를 받아야 한다. ② 본 약관 제 9조(개인위치정보주체의 권리) 의 규정은
      제1항의 규정에 의하여 법정대리인이 동의를 하는 경우에 이를 준용한다. 이
      경우 "회원"은 "법정대리인"으로 본다. 제 11 조 (8세 이하의 아동 등의
      보호의무자의 권리) ① "회사"는 아래의 경우에 해당하는 자(이하 "8세 이하의
      아동"등이라 한다)의 보호의무자가 8세 이하의 아동 등의 생명 또는 신체보호를
      위하여 개인위치정보의 이용 또는 제공에 동의하는 경우에는 본인의 동의가
      있는 것으로 본다. 1. 8세 이하의 아동 2. 금치산자 3. 장애인복지법 제2조
      제2항 제2호의 규정에 의한 정신적 장애를 가진 자로서 장애인고용촉진 및
      직업재활법 제2조 제2호의 규정에 의한 중증장애인에 해당하는 자(장애인복지법
      제29조의 규정에 의하여 장애인등록을 한 자에 한한다) ② 8세 이하의 아동 등의
      생명 또는 신체의 보호를 위하여 개인위치정보의 이용 또는 제공에 동의를
      하고자 하는 보호의무자는 서면동의서에 보호의무자임을 증명하는 서면을
      첨부하여 "회사"에 제출하여야 한다. ③ 본 약관 제 9조(개인위치정보주체의
      권리) 의 규정은 제2항의 규정에 의하여 보호의무자가 동의를 하는 경우에 이를
      준용한다. 이 경우 "회원"은 "보호의무자"로 본다 제12조 (개인위치정보의
      보유목적 및 이용기간) ① 회사는 본 약관 제4조에 따른 위치기반서비스를
      제공하기 위해 필요한 최소한의 기간 동안 개인위치정보를 보유 및 이용합니다.
      ② 회사는 모든 위치기반서비스에서 개인위치정보를 일회성 또는 임시로 이용 후
      지체없이 파기합니다. 제 13 조 (위치정보관리책임자의 지정) ① "회사"는
      위치정보를 적절히 관리,보호하고 개인위치정보주체의 불만을 원활히 처리할 수
      있도록 실질적인 책임을 질 수 있는 지위에 있는 자를 위치정보관리책임자로
      지정해 운영한다. ② 위치정보관리책임자는 위치기반서비스를 제공하는 부서의
      부서장으로서 구체적인 사항은 본 약관의 부칙에 따른다. 제 14 조 (손해배상)
      ① "회사"가 위치정보의 보호 및 이용 등에 관한 법률 제15조 내지 제26조의
      규정을 위반한 행위로 회원에게 손해가 발생한 경우 회원은 "회사"에 대하여
      손해배상 청구를 할 수 있다. 이 경우 "회사"는 고의, 과실이 없음을 입증하지
      못하는 경우 책임을 면할 수 없다. ② 회원이 본 약관의 규정을 위반하여
      "회사"에 손해가 발생한 경우 "회사"는 회원에 대하여 손해배상을 청구할 수
      있다. 이 경우 회원은 고의, 과실이 없음을 입증하지 못하는 경우 책임을 면할
      수 없다. 제 15 조 (면책) ① "회사"는 다음 각 호의 경우로 서비스를 제공할 수
      없는 경우 이로 인하여 회원에게 발생한 손해에 대해서는 책임을 부담하지
      않는다. 1. 천재지변 또는 이에 준하는 불가항력의 상태가 있는 경우 2. 서비스
      제공을 위하여 "회사"와 서비스 제휴계약을 체결한 제3자의 고의적인 서비스
      방해가 있는 경우 3. 회원의 귀책사유로 서비스 이용에 장애가 있는 경우 4.
      제1호 내지 제3호를 제외한 기타 "회사"의 고의·과실이 없는 사유로 인한 경우
      ② "회사"는 서비스 및 서비스에 게재된 정보, 자료, 사실의 신뢰도, 정확성
      등에 대해서는 보증을 하지 않으며 이로 인해 발생한 회원의 손해에 대하여는
      책임을 부담하지 아니한다. 제 16 조 (규정의 준용) 본 약관은 대한민국법령에
      의하여 규정되고 이행된다. 제 17 조 (분쟁의 조정 및 기타) ① "회사"는
      위치정보와 관련된 분쟁에 대해 당사자간 협의가 이루어지지 아니하거나 협의를
      할 수 없는 경우에는 방송통신위원회에 재정을 신청할 수 있다. ② "회사" 또는
      고객은 위치정보와 관련된 분쟁에 대해 당사자간 협의가 이루어지지 아니하거나
      협의를 할 수 없는 경우에는 개인정보분쟁조정위원회에 조정을 신청할 수 있다.
    </p>
  );
};

export default AgreeThree;
